src_Extension/DataProcessors/ПерепроведениеМатСоставПоПериодам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПерепроведениеМатСоставПоПериодам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НайденныеДокументы</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src_Extension/DataProcessors/ПерепроведениеМатСоставПоПериодам/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Инициализация периода по умолчанию - текущий месяц
	Если Объект.НачалоПериода = Неопределено Тогда
		Объект.НачалоПериода = НачалоМесяца(ТекущаяДатаСеанса());
	КонецЕсли;
	Если Объект.КонецПериода = Неопределено Тогда
		Объект.КонецПериода = КонецМесяца(ТекущаяДатаСеанса());
	КонецЕсли;

	// Инициализация таблицы найденных документов
	ИнициализироватьТаблицуНайденныхДокументов();

КонецПроцедуры

&НаСервере
Процедура ИнициализироватьТаблицуНайденныхДокументов()

	ТипСтрока = Новый ОписаниеТипов("Строка");

	Объект.НайденныеДокументы = Новый ТаблицаЗначений;
	Объект.НайденныеДокументы.Колонки.Добавить("СсылкаНаЭтап", Новый ОписаниеТипов("ДокументСсылка.ЭтапПроизводства2_2"));
	Объект.НайденныеДокументы.Колонки.Добавить("Представление", ТипСтрока);
	Объект.НайденныеДокументы.Колонки.Добавить("ДатаДокумента", Новый ОписаниеТипов("Дата"));
	Объект.НайденныеДокументы.Колонки.Добавить("СтатусПроведения", ТипСтрока);
	Объект.НайденныеДокументы.Колонки.Добавить("Результат", ТипСтрока);

КонецПроцедуры

&НаСервере
Функция НайтиДокументыНаСервере()

	Если Объект.НачалоПериода = Неопределено ИЛИ Объект.КонецПериода = Неопределено Тогда
		ВызватьИсключение "Необходимо указать период для поиска";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыходныеИзделия.Ссылка КАК СсылкаНаЭтап,
	|	МИНИМУМ(ВыходныеИзделия.ДатаПроизводства) КАК ДатаПроизводства
	|ПОМЕСТИТЬ ВтВыходные
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ВыходныеИзделия
	|ГДЕ
	|	ВыходныеИзделия.ДатаПроизводства МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ВыходныеИзделия.Ссылка.Проведен = ИСТИНА
	|СГРУППИРОВАТЬ ПО
	|	ВыходныеИзделия.Ссылка
	|ИНДЕКСИРОВАТЬ ПО
	|	СсылкаНаЭтап
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПобочныеИзделия.Ссылка КАК СсылкаНаЭтап,
	|	МИНИМУМ(ПобочныеИзделия.ДатаПроизводства) КАК ДатаПроизводства
	|ПОМЕСТИТЬ ВтПобочные
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ПобочныеИзделия КАК ПобочныеИзделия
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтВыходные КАК ВтВыходные
	|		ПО ПобочныеИзделия.Ссылка = ВтВыходные.СсылкаНаЭтап
	|ГДЕ
	|	ПобочныеИзделия.ДатаПроизводства МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПобочныеИзделия.Ссылка.Проведен = ИСТИНА
	|	И ВтВыходные.СсылкаНаЭтап ЕСТЬ NULL
	|СГРУППИРОВАТЬ ПО
	|	ПобочныеИзделия.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтВыходные.СсылкаНаЭтап КАК СсылкаНаЭтап,
	|	ВтВыходные.СсылкаНаЭтап.Представление КАК Представление,
	|	ВтВыходные.СсылкаНаЭтап.Дата КАК ДатаДокумента,
	|	ВтВыходные.СсылкаНаЭтап.Номер КАК НомерДокумента,
	|	""Проведен"" КАК СтатусПроведения,
	|	ВтВыходные.ДатаПроизводства КАК ДатаПроизводства
	|ИЗ
	|	ВтВыходные КАК ВтВыходные
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВтПобочные.СсылкаНаЭтап,
	|	ВтПобочные.СсылкаНаЭтап.Представление,
	|	ВтПобочные.СсылкаНаЭтап.Дата,
	|	ВтПобочные.СсылкаНаЭтап.Номер,
	|	""Проведен"",
	|	ВтПобочные.ДатаПроизводства
	|ИЗ
	|	ВтПобочные КАК ВтПобочные
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПроизводства";

	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", Объект.КонецПериода);

	Результат = Запрос.Выполнить();
	ТаблицаРезультатов = Результат.Выгрузить();

	// Добавляем колонки для числовой сортировки по номеру
	ТаблицаРезультатов.Колонки.Добавить("НомерЧасть1", Новый ОписаниеТипов("Число"));
	ТаблицаРезультатов.Колонки.Добавить("НомерЧасть2", Новый ОписаниеТипов("Число"));
	ТаблицаРезультатов.Колонки.Добавить("НомерЧасть3", Новый ОписаниеТипов("Число"));

	Для Каждого СтрокаТаблицы Из ТаблицаРезультатов Цикл
		ЧислаИзНомера = ИзвлечьЧислаИзНомера(СтрокаТаблицы.НомерДокумента);
		СтрокаТаблицы.НомерЧасть1 = ЧислаИзНомера.Часть1;
		СтрокаТаблицы.НомерЧасть2 = ЧислаИзНомера.Часть2;
		СтрокаТаблицы.НомерЧасть3 = ЧислаИзНомера.Часть3;
	КонецЦикла;

	// Сортируем: сначала по дате производства, потом по частям номера
	ТаблицаРезультатов.Сортировать("ДатаПроизводства, НомерЧасть1, НомерЧасть2, НомерЧасть3");

	// Заполняем таблицу найденных документов
	Объект.НайденныеДокументы.Очистить();
	Для Каждого СтрокаРезультата Из ТаблицаРезультатов Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаРезультата.СсылкаНаЭтап) Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = Объект.НайденныеДокументы.Добавить();
		НоваяСтрока.СсылкаНаЭтап = СтрокаРезультата.СсылкаНаЭтап;
		НоваяСтрока.Представление = СтрокаРезультата.Представление;
		НоваяСтрока.ДатаДокумента = СтрокаРезультата.ДатаДокумента;
		НоваяСтрока.СтатусПроведения = СтрокаРезультата.СтатусПроведения;
		НоваяСтрока.Результат = "";
	КонецЦикла;

	Возврат Объект.НайденныеДокументы.Количество();

КонецФункции


&НаКлиенте
Процедура НайтиДокументы(Команда)

	КоличествоНайденных = НайтиДокументыНаСервере();

	Если КоличествоНайденных > 0 Тогда
		ПоказатьПредупреждение(, СтрШаблон("Найдено документов: %1", КоличествоНайденных));
	Иначе
		ПоказатьПредупреждение(, "Документы не найдены");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Перепровести(Команда)

	Если Объект.НайденныеДокументы.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не найдено документов для перепроведения. Сначала выполните поиск.");
		Возврат;
	КонецЕсли;


	// Выполняем перепроведение
	ПерепровестиДокументыНаСервере();

	// Итоговое сообщение
	КоличествоУспешно = 0;
	КоличествоОшибок = 0;
	Для Каждого СтрокаТаблицы Из Объект.НайденныеДокументы Цикл
		Если СтрНачинаетсяС(СтрокаТаблицы.Результат, "Успешно") Тогда
			КоличествоУспешно = КоличествоУспешно + 1;
		КонецЕсли;
		Если НЕ СтрНачинаетсяС(СтрокаТаблицы.Результат, "Успешно") И СтрокаТаблицы.Результат <> "" Тогда
			КоличествоОшибок = КоличествоОшибок + 1;
		КонецЕсли;
	КонецЦикла;

	ТекстСообщения = СтрШаблон("Перепроведение завершено.%1Успешно: %2%1Ошибок: %3",
		Символы.ПС, КоличествоУспешно, КоличествоОшибок);
	ПоказатьПредупреждение(, ТекстСообщения);

КонецПроцедуры

&НаСервере
Процедура ПерепровестиДокументыНаСервере()

	Если Объект.НайденныеДокументы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	// === ФАЗА 1: Перепроведение всех документов (формирование базовых движений) ===
	// Сначала перепроводим все этапы, чтобы в регистрах были актуальные данные
	// до начала развёртки полуфабрикатов

	Для Каждого СтрокаТаблицы Из Объект.НайденныеДокументы Цикл

		Попытка
			ДокументОбъект = СтрокаТаблицы.СсылкаНаЭтап.ПолучитьОбъект();

			// Определяем режим проведения
			РежимПроведения = РежимПроведенияДокумента.Неоперативный;
			Если ДокументОбъект.Дата >= НачалоДня(ТекущаяДатаСеанса())
				И СтрокаТаблицы.СсылкаНаЭтап.Метаданные().ОперативноеПроведение =
					Метаданные.СвойстваОбъектов.ОперативноеПроведение.Разрешить Тогда
				РежимПроведения = РежимПроведенияДокумента.Оперативный;
			КонецЕсли;

			// Перепроводим документ
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведения);

			// Обновляем статус
			СтрокаТаблицы.СтатусПроведения = "Проведен";
			СтрокаТаблицы.Результат = "Проведен";

		Исключение
			ПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());

			// Пытаемся исправить ошибку и провести повторно
			Если ПопытатьсяИсправитьОшибкуИПровестиПовторно(ДокументОбъект, ПредставлениеОшибки, РежимПроведения) Тогда
				СтрокаТаблицы.СтатусПроведения = "Проведен";
				СтрокаТаблицы.Результат = "Проведен (после исправления)";
			Иначе
				СтрокаТаблицы.Результат = "Ошибка: " + ПредставлениеОшибки;
			КонецЕсли;
		КонецПопытки;

	КонецЦикла;

	// === ФАЗА 2: Помесячное формирование мат. состава + развёртка полуфабрикатов ===
	// Для каждого успешно проведённого документа:
	// 1. Формируем начальные записи в А1_МатСоставИзделийПоПериодам (помесячное распределение)
	// 2. Разворачиваем полуфабрикаты в новом регистре

	Для Каждого СтрокаТаблицы Из Объект.НайденныеДокументы Цикл

		// Пропускаем документы с ошибками проведения
		Если СтрНачинаетсяС(СтрокаТаблицы.Результат, "Ошибка") Тогда
			Продолжить;
		КонецЕсли;

		Попытка
			ДокументОбъект = СтрокаТаблицы.СсылкаНаЭтап.ПолучитьОбъект();

			// Формируем начальные записи в новый регистр (помесячное распределение)
			Расш1_ОбщийМодуль1.ОбновитьМатСоставПоПериодам(ДокументОбъект);

			// Разворачиваем полуфабрикаты в новом регистре
			Расш1_ОбщийМодуль1.РазвернутьПолуфабрикатыДокументаПоПериодам(ДокументОбъект);

			// Обновляем статус
			СтрокаТаблицы.Результат = "Успешно";

		Исключение
			ПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			СтрокаТаблицы.Результат = "Ошибка развёртки: " + ПредставлениеОшибки;
		КонецПопытки;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПопытатьсяИсправитьОшибкуИПровестиПовторно(ДокументОбъект, ТекстОшибки, РежимПроведения)

	ИсправлениеВыполнено = Ложь;

	// Обработка ошибок, связанных с расходом материала
	Если СтрНачинаетсяС(ТекстОшибки, "Количество расхода материала")
		ИЛИ СтрНачинаетсяС(ТекстОшибки, "Не указан расход материала") Тогда
		Попытка
			ПерезаполнитьРасходПоОбеспечению(ДокументОбъект);
			ИсправлениеВыполнено = Истина;
		Исключение
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;

	// Обработка ошибки "Не заполнена колонка "Выполнено" в строке X списка "Трудозатраты""
	Если СтрНайти(ТекстОшибки, "Не заполнена колонка ""Выполнено""") > 0
		И СтрНайти(ТекстОшибки, "Трудозатраты") > 0 Тогда

		Попытка
			НомерСтроки = ИзвлечьНомерСтрокиИзОшибки(ТекстОшибки);

			Если НомерСтроки > 0 Тогда
				ИндексСтроки = НомерСтроки - 1;

				Если ИндексСтроки < ДокументОбъект.Трудозатраты.Количество() Тогда
					ДокументОбъект.Трудозатраты.Удалить(ИндексСтроки);
					ИсправлениеВыполнено = Истина;
				КонецЕсли;
			КонецЕсли;
		Исключение
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;

	// Если исправление выполнено, пытаемся провести повторно
	Если ИсправлениеВыполнено Тогда
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведения);
			Возврат Истина;
		Исключение
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;

	Возврат Ложь;

КонецФункции

&НаСервере
Процедура ПерезаполнитьРасходПоОбеспечению(ДокументОбъект)

	СтруктураОбъекта = Новый Структура;
	СтруктураОбъекта.Вставить("Ссылка", ДокументОбъект.Ссылка);
	СтруктураОбъекта.Вставить("Подразделение", ДокументОбъект.Подразделение);
	СтруктураОбъекта.Вставить("ОбеспечениеМатериаламиИРаботами", ДокументОбъект.ОбеспечениеМатериаламиИРаботами);
	СтруктураОбъекта.Вставить("РасходМатериаловИРабот", ДокументОбъект.РасходМатериаловИРабот);
	СтруктураОбъекта.Вставить("ЭкономияМатериалов", ДокументОбъект.ЭкономияМатериалов);
	СтруктураОбъекта.Вставить("РасходОднойДатой", ДокументОбъект.РасходОднойДатой);
	СтруктураОбъекта.Вставить("ДатаРасхода", ДокументОбъект.ДатаРасхода);
	СтруктураОбъекта.Вставить("ФактическоеОкончаниеЭтапа", ДокументОбъект.ФактическоеОкончаниеЭтапа);
	СтруктураОбъекта.Вставить("Статус", ДокументОбъект.Статус);

	Документы.ЭтапПроизводства2_2.ЗаполнитьРасходМатериаловИРаботПоДаннымОбеспечения(СтруктураОбъекта, 0);

	ДокументОбъект.РасходМатериаловИРабот.Загрузить(СтруктураОбъекта.РасходМатериаловИРабот);

КонецПроцедуры

&НаСервере
Функция ИзвлечьНомерСтрокиИзОшибки(ТекстОшибки)

	НачалоПоиска = СтрНайти(ТекстОшибки, "в строке ");
	Если НачалоПоиска = 0 Тогда
		Возврат 0;
	КонецЕсли;

	НачалоПозиции = НачалоПоиска + СтрДлина("в строке ");
	КонецПозиции = СтрНайти(Сред(ТекстОшибки, НачалоПозиции), " ");
	Если КонецПозиции = 0 Тогда
		КонецПозиции = СтрНайти(Сред(ТекстОшибки, НачалоПозиции), "списка");
		Если КонецПозиции = 0 Тогда
			Возврат 0;
		КонецЕсли;
	КонецЕсли;

	ТекстНомера = Сред(ТекстОшибки, НачалоПозиции, КонецПозиции - 1);
	НомерСтроки = Число(СокрЛП(ТекстНомера));

	Если НомерСтроки = 0 Тогда
		Возврат 0;
	КонецЕсли;

	Возврат НомерСтроки;

КонецФункции

&НаСервере
Функция ИзвлечьЧислаИзНомера(НомерДокумента)

	Результат = Новый Структура("Часть1, Часть2, Часть3", 0, 0, 0);

	Если НЕ ЗначениеЗаполнено(НомерДокумента) Тогда
		Возврат Результат;
	КонецЕсли;

	ПозицияДефиса = СтрНайти(НомерДокумента, "-");
	Если ПозицияДефиса > 0 Тогда
		НомерБезПрефикса = Сред(НомерДокумента, ПозицияДефиса + 1);
	Иначе
		НомерБезПрефикса = НомерДокумента;
	КонецЕсли;

	Части = СтрРазделить(НомерБезПрефикса, ".");

	Если Части.Количество() >= 1 Тогда
		Попытка
			Результат.Часть1 = Число(Части[0]);
		Исключение
		КонецПопытки;
	КонецЕсли;

	Если Части.Количество() >= 2 Тогда
		Попытка
			Результат.Часть2 = Число(Части[1]);
		Исключение
		КонецПопытки;
	КонецЕсли;

	Если Части.Количество() >= 3 Тогда
		Попытка
			Результат.Часть3 = Число(Части[2]);
		Исключение
		КонецПопытки;
	КонецЕсли;

	Возврат Результат;

КонецФункции
